{
  "book_name": "Obadiah",
  "hebrew_name": "עֹבַדְיָה (Ovadyah)",
  "canonical_grouping": "Minor Prophets",
  "big_picture_notes": "Obadiah is the shortest OT book and a single, sustained oracle structured by a judgment→Day of Yahweh→restoration arc. It contrasts Edom (Esau) and Israel (Jacob) through repeated motifs of pride/violence versus inheritance/salvation. The movement runs from Edom’s humbling (vv. 1–14), to the universal Day of Yahweh pivot (v. 15), to Zion’s deliverance and possession (vv. 16–21). Lex talionis ('as you have done, it shall be done to you') and inheritance language bind the units, culminating in the eschatological close: 'the kingdom shall be Yahweh’s.'",
  "stories": [
    {
      "story_letter": "A",
      "story_title": "The Vision of Obadiah: The Judgment of Esau and the Reign of Jacob",
      "why_start_end_and_literary_glue": "The entire book (1:1–21) is a single cohesive oracle, opened by the vision superscription and concluded by Yahweh’s kingship. Internally it progresses: Edom’s pride cast down and betrayed by allies (1:1–7), Edom’s crimes in the day of Jacob’s calamity (1:8–14), and the Day of Yahweh pivoting to Zion’s deliverance and universal rule (1:15–21). Glue: height→lowliness irony, lex talionis (1:15), and repeated 'possess/inherit' language (1:17, 19–20).",
      "reference": "1:1 - 1:21",
      "scenes": [
        {
          "scene_number": 1,
          "scene_name": "Edom's High Place Made Low",
          "reference": "1:1-1:7",
          "why_start_end_and_devices": "Begins with the vision/oracle announcement and decree of smallness; height imagery ridicules Edom’s pride ('clefts of the rock' → 'among the stars') before the betrayal motif resolves the unit: allies who eat your bread ensnare you. Devices: irony, hyperbole, thieves/grape-gatherer analogies."
        },
        {
          "scene_number": 2,
          "scene_name": "The Crime: Days of Violence Against Jacob",
          "reference": "1:8-1:14",
          "why_start_end_and_devices": "Opens with the rhetorical 'Will I not… destroy the wise of Edom?' and catalogs Edom’s complicity on Judah’s disaster day. Verses 12–14 form a staccato series of 'do not' charges (gloat, plunder, hand over survivors), completing the indictment before the Day pivot. Devices: rhetorical questions, parallelism, prohibitive anaphora."
        },
        {
          "scene_number": 3,
          "scene_name": "The Day of Yahweh and Zion's Reign",
          "reference": "1:15-1:21",
          "why_start_end_and_devices": "The universal Day of Yahweh ('near upon all nations') introduces lex talionis ('as you have done…'), while Zion’s deliverance/holiness and the house of Jacob as fire reduce Esau to stubble. Geographic possession lists ('they shall possess…') culminate in the final sovereignty: 'the kingdom shall be Yahweh’s.' Devices: contrast, consumption/fire metaphor, inheritance formulae."
        }
      ]
    }
  ]
}

